import 'package:html/parser.dart' as htmlparser;
import 'package:html/dom.dart' as dom;


String htmlData = """<div>
  <h1> الشروط والاحكام وسياسة الخصوصية</h1>
  <p>تطبيق car SA تعتبر إتفاقية الشروط والأحكام هذه ،إتفاق بين تطبيق car SA والعميل والراغبين بالأستفادة من الخدمات المتاحه المقدمة من car SA
يعد إستخدامك للتطبيق والخدمات المتاحه من خلال الموافقه على هذه الأتفاقيه ،وبذالك انت تقر وتوافق ان اي استخدام يتم من قبِلكم او من قِبل جهازك او حسابك او رقمك يعود لك ،

الخدمات التي يوفرها تطبيق car SA يتعبر موافقة منك على هذه الاتفاقيه وبنأ على ذالك يجيب عليك عدم استخدام Car SA في حال لم تكن موافق على هذه الاتفاقيه او على شي ماتتضمنه هذه الاتفاقيه ، نحتفظ بحقنا بتغيير الشروط والاحاكم من وقت لأخر ، وعليه يتعين عليك الإطلاع على هذه الشروط والاحكام بشكل دوري</p>
  <h3>١/ التعريفات :-</h3>
  <p>تطبيق خاص في بيع قطع غيار السيارات .<p/>
  <h3> ٢/الشروط والاحكام وسياسة الخصوصية :-</h3>
  <p>تعني هذه الشروط والاحكام والتي قد تخضع للتعديل او التغيير من وقت لأخر للاستخدام المشروع للدخول الى تطبيق car SA ، يجب الأ يقل عمرك عن ١٨ عام وان تكون ذو اهليه قانونيه كامله للتعاقد والتعامل .
يجب ان تقدم معلومات صحيحه ودقيقه كما يجب عليك الإلتزام لإي إشعارات يقوم بها تطبيقنا بما يخص الخدمات التي نقدمها ،لضمان عدم تعرقل إي عمليات تشغيلية نقوم بها .
يجب ان لايكون إستخدامك لتطبيق car SA مسبب لإي اذى او مضايقات او ازعاج لإي شخص كان .
المحافظة على كامل المحتويات والارقام السريه والدخول لحسابك بشكل امن يتعبر رقم هاتفكم او اي عنوان اخر تابع للعميل ،وسيلة رسميه للتواصل .
في حالة طُلب منك يجيب ان تقدم موقعك الصحيح لإستلام طلبكم .
يحق للتطبيق car SA الامتناع عن الخدمة عند استخدام العميل للتطبيق بشكل خاطئ على سيبل المثال وليس حصر ،رفع اكثر من طلب بطريقة غير صحيحة .
لايحق لك الإلغاء اي خدمة الا بعد مراجعة سياسة الاستبدال والاسترجاع .
لانتحمل مسؤليات اتجاهك او اي شخص اخر نتيجة اي خساره ناجمة عن امر لاسيطره لنا عليه مثل الكوارث الطبيعية او غيرها .
عند إستخدامك للتطبيق يتوجب عليك دائماً اخذ الاحتياطات التالية :
١)-المحافظة على سرية هويتك .
٢)-لاتعطي اسمك الكامل او ارقام تحدد منك والتي قد من خلالها معرفة الهاتف او غيرها من المعلومات ،بستثناء التي نطلبها منك عن طريق الارقام الموضحه داخل التطبيق .<p/>
  <h3>شروط واحكام الشراء :-</h3>
  <p>قد يتأخر تسليم السلعة للعميل من يوم إلى ٧ أيام .
-يتعبر يوم الجمعة والسبت خارج اوقات شحن أي منتج ،ونتواصل مع العميل ونخبره بموعد تسليم المنتج .
-نحرص ان يكون سعر الشراء هو نفس السعر المذكور عند طلب تسعيره للعميل .
-لايحق للعميل المطالبه بأي تعويضات او تغيير السعر بعد تقديم طلب الشراء .<p/>
  <h3>سياسة الخصوصية:.</h3>
  <p>نقدر مخاوفكم وإهتمامكم بشأن خصوصية بيناتكم ، لقد تم اعداد هذه السياسة لمساعدتكم في تفهم طبيعة البينات التي نقوم بجمعها منكم عند زيارتكم لموقعنا ، وكيفية تعاملنا مع هذه البينات الشخصية لم نقوم بتصميم هذا التطبيق من أجل تجميع بيناتك الشخصية  الخاصة بك اثناء تصفحك لهذا التطبيق وانما سيتم فقط استخدام البينات المقدمه من قبلكم ،لمعرفتك ومحظ ارداتكم ،ان عمليات التي نجمعها الاسم ورقم الهاتف والموقع في حال طلبكم للمنتج ، ستم التعامل مع كيفية البينات المقدمه من قبلكم على اساس انها سرية
نحتفظ بالحق في تعديل بنود وشروط سياسة الخصوصية ان لزم الامر ومتى ماكان ذالك ملائمًا سيتم التعديلات هنا او على صفحة الخصوصية وسيتم بصفة مستمره، يمكنك الاتصال بنا عند الحاجه من خلال التطبيق قسم الدعم الفني او الاتصال او الارسال داخل الرقم الموضح داخل التطبيق .<p/>

  
</div>""";
dom.Document document = htmlparser.parse(htmlData);